# Groupby

In [1]:
import pandas as pd
# Create dataframe
data1 = {'Location':['PUNE','MYS','HYDB','MYS','PUNE','MYS'],
       'Person':['Ram','Harish','Anand','Sudha','Sumegha','Melvin'],
       'Sales':[1200,1120,1340,1124,2143,1340]}

In [2]:
df1 = pd.DataFrame(data1)

In [3]:
df1

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1120
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1340

In [4]:
df1.transpose()

             0       1      2      3        4       5
Location  PUNE     MYS   HYDB    MYS     PUNE     MYS
Person     Ram  Harish  Anand  Sudha  Sumegha  Melvin
Sales     1200    1120   1340   1124     2143    1340

In [5]:
# grouping based on Location
df1.groupby('Location')

In [6]:
by_location = dflocation1.groupby("Location")

In [19]:
by_location

In [20]:
by_location.mean() #applying aggregate method on it

                Sales
Location
HYDB      1340.000000
MYS       1194.666667
PUNE      1671.500000

In [9]:
df1.groupby('Location').mean()

                Sales
Location
HYDB      1340.000000
MYS       1194.666667
PUNE      1671.500000

In [10]:
by_location.std() #for standard deviation

               Sales
Location
HYDB             NaN
MYS       125.878248
PUNE      666.801695

In [11]:
by_location.min()

          Person  Sales
Location
HYDB       Anand   1340
MYS       Harish   1120
PUNE         Ram   1200

In [12]:
by_location.max()

           Person  Sales
Location
HYDB        Anand   1340
MYS         Sudha   1340
PUNE      Sumegha   2143

In [13]:
by_location.count()

          Person  Sales
Location
HYDB           1      1
MYS            3      3
PUNE           2      2

In [14]:
by_location.describe()

         Sales                                                             \
         count         mean         std     min      25%     50%      75%
Location
HYDB       1.0  1340.000000         NaN  1340.0  1340.00  1340.0  1340.00
MYS        3.0  1194.666667  125.878248  1120.0  1122.00  1124.0  1232.00
PUNE       2.0  1671.500000  666.801695  1200.0  1435.75  1671.5  1907.25


             max
Location
HYDB      1340.0
MYS       1340.0
PUNE      2143.0

In [15]:
by_location.describe().transpose()

Location       HYDB          MYS         PUNE
Sales count     1.0     3.000000     2.000000
      mean   1340.0  1194.666667  1671.500000
      std       NaN   125.878248   666.801695
      min    1340.0  1120.000000  1200.000000
      25%    1340.0  1122.000000  1435.750000
      50%    1340.0  1124.000000  1671.500000
      75%    1340.0  1232.000000  1907.250000
      max    1340.0  1340.000000  2143.000000

In [16]:
by_location.describe().transpose()['MYS']

Sales  count       3.000000
       mean     1194.666667
       std       125.878248
       min      1120.000000
       25%      1122.000000
       50%      1124.000000
       75%      1232.000000
       max      1340.000000
Name: MYS, dtype: float64